{
    "articles" :[

        {
            "heading": "A New Project",
            "author": "Daniel Stirba",
            "time": "7:13am 26/12/2019",
            "content": "<p>To be completely honest I forgot I had this Blog Site set up... that was until I started this project and realised it would be excellent to record my journey with developing in Java</p><p>So have you ever played a Game of stardew Valley? Well currently me and my girlfriend have been addicted to the game. Building a farm that both enjoyable for use and pleasing to look at has been hella fun to do, however we realised that as our ambitions started to grow so did the difficulty of planning out our farm for the task.</p><p>Now already there is a very acceptable web app that does the job well, and that is <a href='https://stardew.info/planner/#'>The Stardew Valley Planner V2</a>, however you have to donate to use the multiplanner (in other terms pay to plan with others), which as a Uni student with every dollar going into life at the moment unfortunatly i'm a bit stingy about these things.</p><p>So i've decided to throw logic to the curb cause it would be cheaper to stretch my brain muscles. The Goal of this new project is to replicate the stardew valley planner in java while providing multiplanner functionality without having to spend a dime.</p><p>if by any chance Dear reader my project interests you (good job making your way to this blog site!!).. well at this current time I'm not opening this up to the public. The project itself is in a basic state (currently just a grid on a JFrame), so I want to get something that actually works before even considering releasing it to the public.</p>"
        },
        {
            "heading": "Learning To Pixel Art",
            "author": "Daniel Stirba",
            "time": "12:42am 2/06/2019",
            "content": "<p>Pixel Art is a Unique Art form That I hold Very Dear to me. Its a symbol of my youth and an easier to learn art form.</p><p>Learning to Pixel Art has been something I've done from a young age. More then likely I will continue to strive to create artworks like the sprites that you see on this page more and more. I want to truely refine my style so that I can use it in the creation of 2d Video Games, however I feel my level of design is not up to that standard yet.</p><p>The Creative process for me is quite standard as it involves hours of searching example images on google, this process involves looking and analysing the styles i either want to copy and make my own or ideas for positioning of objects and elements on the canvas.</p><p>Drawing takes the most time, I use a program Called Promotion NG to create my Artworks. Its designed for pixel artists and contains a bunch of tools to create pixel art.</p><div class='Image-holder'><img class='post-img' src='Images/ProMotionNgExample.PNG' alt='Example Image of Promotion NG'></div><p>Using this I've created all the assets that you can see on the this website except for the background. Using Pixel art as an artistic medium was freeing in a way, as the more constrained you are with creating your artwork the more you had to think outside the box in order to make it happen.</p><div class='Image-holder'><img class='post-img-cul' src='Images/cauldron.png' alt='Example of a Cauldron I drew.'></div>"
        },
        {
            "heading": "My Journey into Web Dev.",
            "author": "Daniel Stirba",
            "time": "4:07pm 29/05/2019",
            "content": "<p>My journey into web development has been an interesting one. I've learnt Many new things about how CSS and Html5 work and overall I have really enjoyed the experience.</p><p> I would have to say that I'm most impressed with the border design that I used for the posts it involves creating a border image and then using that image to wrap around the element.</p><p>here is the CSS that I used:</p><pre><code> article {</code>\n<code>      border: 50px solid transparent;</code>\n<code>      border-image: url(../Images/Website-border.png) 16 repeat;</code>\n<code>      margin: 16px;</code>\n<code>      image-rendering: pixelated;</code>\n<code> }</code><div class='clr'></div></pre></div>"
        }

    ]
}